; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image2 - mode
	thermograph3 - mode
	infrared0 - mode
	infrared1 - mode
	Star2 - direction
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 162)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star3)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 182)
	(= (data Star4 image2) 42)
	(= (data Star5 image2) 136)
	(= (data Phenomenon6 image2) 150)
	(= (data Star7 image2) 226)
	(= (data Star4 thermograph3) 265)
	(= (data Star5 thermograph3) 280)
	(= (data Phenomenon6 thermograph3) 259)
	(= (data Star7 thermograph3) 60)
	(= (data Star4 infrared0) 134)
	(= (data Star5 infrared0) 138)
	(= (data Phenomenon6 infrared0) 171)
	(= (data Star7 infrared0) 283)
	(= (data Star4 infrared1) 20)
	(= (data Star5 infrared1) 217)
	(= (data Phenomenon6 infrared1) 55)
	(= (data Star7 infrared1) 157)
	(= (slew_time Star2 Star0) 5.14)
	(= (slew_time Star0 Star2) 5.14)
	(= (slew_time Star2 GroundStation1) 19.54)
	(= (slew_time GroundStation1 Star2) 19.54)
	(= (slew_time Star3 Star0) 44.62)
	(= (slew_time Star0 Star3) 44.62)
	(= (slew_time Star3 GroundStation1) 14.16)
	(= (slew_time GroundStation1 Star3) 14.16)
	(= (slew_time Star3 Star2) 53.22)
	(= (slew_time Star2 Star3) 53.22)
	(= (slew_time GroundStation1 Star0) 22.57)
	(= (slew_time Star0 GroundStation1) 22.57)
	(= (slew_time Star4 Star0) 1.961)
	(= (slew_time Star0 Star4) 1.961)
	(= (slew_time Star4 GroundStation1) 13.38)
	(= (slew_time GroundStation1 Star4) 13.38)
	(= (slew_time Star4 Star2) 46.27)
	(= (slew_time Star2 Star4) 46.27)
	(= (slew_time Star4 Star3) 31.04)
	(= (slew_time Star3 Star4) 31.04)
	(= (slew_time Star5 Star0) 15.03)
	(= (slew_time Star0 Star5) 15.03)
	(= (slew_time Star5 GroundStation1) 8.82)
	(= (slew_time GroundStation1 Star5) 8.82)
	(= (slew_time Star5 Star2) 12.45)
	(= (slew_time Star2 Star5) 12.45)
	(= (slew_time Star5 Star3) 40.61)
	(= (slew_time Star3 Star5) 40.61)
	(= (slew_time Star5 Star4) 66.1)
	(= (slew_time Star4 Star5) 66.1)
	(= (slew_time Phenomenon6 Star0) 34.85)
	(= (slew_time Star0 Phenomenon6) 34.85)
	(= (slew_time Phenomenon6 GroundStation1) 25)
	(= (slew_time GroundStation1 Phenomenon6) 25)
	(= (slew_time Phenomenon6 Star2) 27.77)
	(= (slew_time Star2 Phenomenon6) 27.77)
	(= (slew_time Phenomenon6 Star3) 5.3)
	(= (slew_time Star3 Phenomenon6) 5.3)
	(= (slew_time Phenomenon6 Star4) 50.5)
	(= (slew_time Star4 Phenomenon6) 50.5)
	(= (slew_time Phenomenon6 Star5) 3.633)
	(= (slew_time Star5 Phenomenon6) 3.633)
	(= (slew_time Star7 Star0) 67.14)
	(= (slew_time Star0 Star7) 67.14)
	(= (slew_time Star7 GroundStation1) 76.46)
	(= (slew_time GroundStation1 Star7) 76.46)
	(= (slew_time Star7 Star2) 51.81)
	(= (slew_time Star2 Star7) 51.81)
	(= (slew_time Star7 Star3) 0.9414)
	(= (slew_time Star3 Star7) 0.9414)
	(= (slew_time Star7 Star4) 28.44)
	(= (slew_time Star4 Star7) 28.44)
	(= (slew_time Star7 Star5) 14.38)
	(= (slew_time Star5 Star7) 14.38)
	(= (slew_time Star7 Phenomenon6) 41.36)
	(= (slew_time Phenomenon6 Star7) 41.36)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star3)
	(have_image Star4 infrared1)
	(have_image Star5 infrared1)
	(have_image Phenomenon6 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 182 to 176.7, (fuel-used) from 0 to 5.3
   goals met: 0 of 5
2. (turn_to satellite1 star5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star5)
   changed: (fuel satellite1) from 176.7 to 173.067, (fuel-used) from 5.3 to 8.933
   goals met: 0 of 5
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 star0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 162 to 160.039, (fuel-used) from 8.933 to 10.894
   goals met: 0 of 5
5. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 5
6. (turn_to satellite0 star4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 160.039 to 158.078, (fuel-used) from 10.894 to 12.855
   goals met: 0 of 5
7. (take_image satellite0 star4 instrument1 infrared1)
   added: (have_image star4 infrared1)
   changed: (data_capacity satellite0) from 1000 to 980, (data-stored) from 0 to 20
   goals met: 1 of 5
8. (turn_to satellite0 groundstation1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 158.078 to 144.698, (fuel-used) from 12.855 to 26.235
   goals met: 2 of 5
9. (turn_to satellite1 star3 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 173.067 to 132.457, (fuel-used) from 26.235 to 66.845
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 144.698 to 119.698, (fuel-used) from 66.845 to 91.845
   goals met: 2 of 5
11. (take_image satellite0 phenomenon6 instrument1 infrared0)
   added: (have_image phenomenon6 infrared0)
   changed: (data_capacity satellite0) from 980 to 809, (data-stored) from 20 to 191
   goals met: 3 of 5
12. (turn_to satellite0 star5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 119.698 to 116.065, (fuel-used) from 91.845 to 95.478
   goals met: 3 of 5
13. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   changed: (data_capacity satellite0) from 809 to 592, (data-stored) from 191 to 408
   goals met: 4 of 5
14. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 116.065 to 107.245, (fuel-used) from 95.478 to 104.298
   goals met: 5 of 5
